import styled from "styled-components";
import Container from "./utils/Container";
import FlexContainer from "./utils/FlexContainer";
import Card from "./Card";

const ArticleContainerStyled = styled.div`
  background-color: #f9f9f9;
  padding: 25px 0;
`;

const data = [
  {
    title: "হার্স্ট বনাম পুলিৎজার: সাংবাদিকতার হলুদ অধ্যায়",
    category: "ইতিহাস",
    date: "4 Jan 2021",
    slug: "2020-world-politics-review-1",
    weitter: "Usama Rafid",
    mainImg: "https://assets.roar.media/assets/XBKfzUVGqsKpvkkV_01-opener-span-am-war.adapt.1900.1.jpg?w=800",
    coverImg: "https://assets.roar.media/assets/c8snZgdpF56zS4Ie_trolley_0.jpg",
    description:
      "২০২০ সালের ২৯ ডিসেম্বর ফিলিস্তিনের গাজা ভূখণ্ডে একটি অভূতপূর্ব ঘটনা সংঘটিত হয়েছে। গাজা ভূখণ্ডে সক্রিয় সকল রাজনৈতিক গ্রুপের সামরিক সংস্থাগুলো একটি যৌথ সামরিক মহড়ায় অংশগ্রহণ করেছে। ২০০৫ সালে গাজা ভূখণ্ড থেকে ইসরায়েলি পশ্চাৎপসরণের পর ভূখণ্ডটিতে অনুষ্ঠিত সামরিক মহড়াগুলোর মধ্যে এটিই প্রথম, যেটিতে গাজায় সক্রিয় সকল ফিলিস্তিনি গ্রুপ অংশ নিয়েছে। অভূতপূর্ব এই যৌথ সামরিক মহড়ার নামকরণ করা হয়েছে 'আর–রুকন আস–শাদিদ', যার বাংলা অর্থ দাঁড়ায় 'শক্তিশালী ভিত্তি'। <br/> 'গাজা ভূখণ্ড' (Gaza Strip) পূর্ব ভূমধ্যসাগরের তীরে অবস্থিত ৩৬৫ বর্গ কি.মি. আয়তনবিশিষ্ট একটি ক্ষুদ্র অঞ্চল। ১৯৪৮–৪৯ সালের আরব–ইসরায়েলি যুদ্ধের সময় ভূখণ্ডটি মিসরের হস্তগত হয়, এবং ১৯৬৭ সালের আরব–ইসরায়েল যুদ্ধের সময় ইসরায়েল ভূখণ্ডটি মিসরের কাছ থেকে দখল করে নেয়। ১৯৯৪ সালে ইসরায়েল ও 'ফিলিস্তিনি মুক্তি সংস্থা'র (Palestine Liberation Organization, 'PLO') মধ্যে স্বাক্ষরিত 'অসলো চুক্তি' অনুযায়ী ইসরায়েল গাজা ভূখণ্ডকে 'ফিলিস্তিনি জাতীয় কর্তৃপক্ষে'র (Palestinian National Authority, 'PNA') হস্তান্তর করতে সম্মত হয়, এবং নানা সঙ্কটের পর ২০০৫ সালে ইসরায়েল এককভাবে গাজা ভূখণ্ড থেকে পশ্চাৎপসরণ করে।",
  },
  {
    title: "আর–রুকন আস–শাদিদ: গাজা ভূখণ্ডের ইতিহাসে প্রথম যৌথ সামরিক মহড়া",
    category: "বিশ্ব",
    date: "4 Jan 2021",
    slug: "2020-world-politics-review-1",
    weitter: "Himel Rahman",
    mainImg: "https://assets.roar.media/assets/TbzuI1HRirpNrSmJ_GettyImages-1230345058-1600.jpg?w=800",
    coverImg: "https://assets.roar.media/assets/c8snZgdpF56zS4Ie_trolley_0.jpg",
    description:
      "২০২০ সালের ২৯ ডিসেম্বর ফিলিস্তিনের গাজা ভূখণ্ডে একটি অভূতপূর্ব ঘটনা সংঘটিত হয়েছে। গাজা ভূখণ্ডে সক্রিয় সকল রাজনৈতিক গ্রুপের সামরিক সংস্থাগুলো একটি যৌথ সামরিক মহড়ায় অংশগ্রহণ করেছে। ২০০৫ সালে গাজা ভূখণ্ড থেকে ইসরায়েলি পশ্চাৎপসরণের পর ভূখণ্ডটিতে অনুষ্ঠিত সামরিক মহড়াগুলোর মধ্যে এটিই প্রথম, যেটিতে গাজায় সক্রিয় সকল ফিলিস্তিনি গ্রুপ অংশ নিয়েছে। অভূতপূর্ব এই যৌথ সামরিক মহড়ার নামকরণ করা হয়েছে 'আর–রুকন আস–শাদিদ', যার বাংলা অর্থ দাঁড়ায় 'শক্তিশালী ভিত্তি'। <br/> 'গাজা ভূখণ্ড' (Gaza Strip) পূর্ব ভূমধ্যসাগরের তীরে অবস্থিত ৩৬৫ বর্গ কি.মি. আয়তনবিশিষ্ট একটি ক্ষুদ্র অঞ্চল। ১৯৪৮–৪৯ সালের আরব–ইসরায়েলি যুদ্ধের সময় ভূখণ্ডটি মিসরের হস্তগত হয়, এবং ১৯৬৭ সালের আরব–ইসরায়েল যুদ্ধের সময় ইসরায়েল ভূখণ্ডটি মিসরের কাছ থেকে দখল করে নেয়। ১৯৯৪ সালে ইসরায়েল ও 'ফিলিস্তিনি মুক্তি সংস্থা'র (Palestine Liberation Organization, 'PLO') মধ্যে স্বাক্ষরিত 'অসলো চুক্তি' অনুযায়ী ইসরায়েল গাজা ভূখণ্ডকে 'ফিলিস্তিনি জাতীয় কর্তৃপক্ষে'র (Palestinian National Authority, 'PNA') হস্তান্তর করতে সম্মত হয়, এবং নানা সঙ্কটের পর ২০০৫ সালে ইসরায়েল এককভাবে গাজা ভূখণ্ড থেকে পশ্চাৎপসরণ করে।",
  },
  {
    title: "পশ্চিম সাহারা: একটি অঞ্চলের পরাধীনতার দুঃখগাথা",
    category: "ইতিহাস",
    date: "4 Jan 2021",
    slug: "2020-world-politics-review-1",
    weitter: "Imtiaz Ahmed",
    mainImg: "https://assets.roar.media/assets/6kGETHIb4u6Zrz65_Africannews.jpg?w=800",
    coverImg: "https://assets.roar.media/assets/c8snZgdpF56zS4Ie_trolley_0.jpg",
    description:
      "২০২০ সালের ২৯ ডিসেম্বর ফিলিস্তিনের গাজা ভূখণ্ডে একটি অভূতপূর্ব ঘটনা সংঘটিত হয়েছে। গাজা ভূখণ্ডে সক্রিয় সকল রাজনৈতিক গ্রুপের সামরিক সংস্থাগুলো একটি যৌথ সামরিক মহড়ায় অংশগ্রহণ করেছে। ২০০৫ সালে গাজা ভূখণ্ড থেকে ইসরায়েলি পশ্চাৎপসরণের পর ভূখণ্ডটিতে অনুষ্ঠিত সামরিক মহড়াগুলোর মধ্যে এটিই প্রথম, যেটিতে গাজায় সক্রিয় সকল ফিলিস্তিনি গ্রুপ অংশ নিয়েছে। অভূতপূর্ব এই যৌথ সামরিক মহড়ার নামকরণ করা হয়েছে 'আর–রুকন আস–শাদিদ', যার বাংলা অর্থ দাঁড়ায় 'শক্তিশালী ভিত্তি'। <br/> 'গাজা ভূখণ্ড' (Gaza Strip) পূর্ব ভূমধ্যসাগরের তীরে অবস্থিত ৩৬৫ বর্গ কি.মি. আয়তনবিশিষ্ট একটি ক্ষুদ্র অঞ্চল। ১৯৪৮–৪৯ সালের আরব–ইসরায়েলি যুদ্ধের সময় ভূখণ্ডটি মিসরের হস্তগত হয়, এবং ১৯৬৭ সালের আরব–ইসরায়েল যুদ্ধের সময় ইসরায়েল ভূখণ্ডটি মিসরের কাছ থেকে দখল করে নেয়। ১৯৯৪ সালে ইসরায়েল ও 'ফিলিস্তিনি মুক্তি সংস্থা'র (Palestine Liberation Organization, 'PLO') মধ্যে স্বাক্ষরিত 'অসলো চুক্তি' অনুযায়ী ইসরায়েল গাজা ভূখণ্ডকে 'ফিলিস্তিনি জাতীয় কর্তৃপক্ষে'র (Palestinian National Authority, 'PNA') হস্তান্তর করতে সম্মত হয়, এবং নানা সঙ্কটের পর ২০০৫ সালে ইসরায়েল এককভাবে গাজা ভূখণ্ড থেকে পশ্চাৎপসরণ করে।",
  },
  {
    title: "অ্যাস্ট্রাজেনেকা-অক্সফোর্ডের কোভিড ভ্যাক্সিন",
    category: "স্বাস্থ্য",
    date: "4 Jan 2021",
    slug: "2020-world-politics-review-1",
    weitter: "Nafis A. Shanto",
    mainImg: "https://assets.roar.media/assets/Dn53ZtzLqvUm72sQ_feature.jpg?w=800",
    coverImg: "https://assets.roar.media/assets/c8snZgdpF56zS4Ie_trolley_0.jpg",
    description:
      "২০২০ সালের ২৯ ডিসেম্বর ফিলিস্তিনের গাজা ভূখণ্ডে একটি অভূতপূর্ব ঘটনা সংঘটিত হয়েছে। গাজা ভূখণ্ডে সক্রিয় সকল রাজনৈতিক গ্রুপের সামরিক সংস্থাগুলো একটি যৌথ সামরিক মহড়ায় অংশগ্রহণ করেছে। ২০০৫ সালে গাজা ভূখণ্ড থেকে ইসরায়েলি পশ্চাৎপসরণের পর ভূখণ্ডটিতে অনুষ্ঠিত সামরিক মহড়াগুলোর মধ্যে এটিই প্রথম, যেটিতে গাজায় সক্রিয় সকল ফিলিস্তিনি গ্রুপ অংশ নিয়েছে। অভূতপূর্ব এই যৌথ সামরিক মহড়ার নামকরণ করা হয়েছে 'আর–রুকন আস–শাদিদ', যার বাংলা অর্থ দাঁড়ায় 'শক্তিশালী ভিত্তি'। <br/> 'গাজা ভূখণ্ড' (Gaza Strip) পূর্ব ভূমধ্যসাগরের তীরে অবস্থিত ৩৬৫ বর্গ কি.মি. আয়তনবিশিষ্ট একটি ক্ষুদ্র অঞ্চল। ১৯৪৮–৪৯ সালের আরব–ইসরায়েলি যুদ্ধের সময় ভূখণ্ডটি মিসরের হস্তগত হয়, এবং ১৯৬৭ সালের আরব–ইসরায়েল যুদ্ধের সময় ইসরায়েল ভূখণ্ডটি মিসরের কাছ থেকে দখল করে নেয়। ১৯৯৪ সালে ইসরায়েল ও 'ফিলিস্তিনি মুক্তি সংস্থা'র (Palestine Liberation Organization, 'PLO') মধ্যে স্বাক্ষরিত 'অসলো চুক্তি' অনুযায়ী ইসরায়েল গাজা ভূখণ্ডকে 'ফিলিস্তিনি জাতীয় কর্তৃপক্ষে'র (Palestinian National Authority, 'PNA') হস্তান্তর করতে সম্মত হয়, এবং নানা সঙ্কটের পর ২০০৫ সালে ইসরায়েল এককভাবে গাজা ভূখণ্ড থেকে পশ্চাৎপসরণ করে।",
  },
];

const ArticleContainer = (props) => {
  return (
    <ArticleContainerStyled>
      <Container>
        <FlexContainer>
          {data.map((item, index) => {
            return <Card item={item} key={index} />;
          })}
        </FlexContainer>
      </Container>
    </ArticleContainerStyled>
  );
};

export default ArticleContainer;
