import styled from "styled-components";
import Container from "./utils/Container";

const ContentContainerStyled = styled.div`
  max-width: 760px;
  margin: 0 auto;
`;

const ContentContainer = (props) => {
  return (
    <Container>
      <ContentContainerStyled>
        <p>
          নারীদের জন্য তৈরি জেল ‘ক্যাসা ডি রিকোহিদাস’-এর দেয়ালের একেবারে গা ঘেঁষে তৈরি হওয়া হোটেলের জানালা থেকে আবারো পুরো পরিকল্পনা ভেবে নিলেন কার্ল
          ডেকার। সুদূর নিউ ইয়র্ক থেকে এই অপরিচ্ছন্ন হাভানায় তাকে পাঠানোর মূল উদ্দেশ্য এই জেল থেকে এক রাজনৈতিক বন্দীকে বের করে আনা। সাংবাদিক হিসেবে
          ঘটনার সাথে জড়িয়ে যাওয়াটা অবশ্য তার জন্য নতুন নয়, নিউ ইয়র্ক জার্নালের মালিক উইলিয়াম র‍্যান্ডলফ হার্স্ট এ ধরনের সাংবাদিকতাকে একটি গালভরা নাম
          দিয়েছেন: ‘মডার্ন জার্নালিজম’। হার্স্টের মতে, সাংবাদিকদের কাজ শুধু ঘটনার বিবরণ সংগ্রহ করা বা তার ব্যাখ্যা দেওয়াই নয়, বরং ঘটনার সাথে জড়িয়ে
          গিয়ে তাকে প্রভাবিত করাও! অবশ্য এর সাফল্যও কম নয়, হার্স্টের আদেশে সাংবাদিক উইনিফ্রেড ব্ল্যাক হাসপাতালে রোগী সেজে হাসপাতালের দুর্নীতির
          নাড়ি-নক্ষত্র বের করে এনেছিলেন, তার পরদিনই হাসপাতালের নার্স-ডাক্তারসহ দুর্নীতির সাথে জড়িত সবার বাসায় বরখাস্তের নোটিশ পৌঁছে গিয়েছিল। তবে
          হার্স্টের এবারের পরিকল্পনা বেশ উচ্চাকাঙ্ক্ষী। নিজের পত্রিকার কাটতি বাড়াতে দেশ ছাড়িয়ে বিদেশের রাজনীতিতে হস্তক্ষেপ করার পরিকল্পনা করছেন তিনি।
          হাভানার দায়িত্বে থাকা জার্নালের রিপোর্টার ব্রাইসনকে গত জুলাই মাসে নিউ ইয়র্কে ফেরত আসতে হয়েছিল এই বিশেষ রাজনৈতিক বন্দীকে মুক্ত করার গুজব
          ছড়িয়ে পড়ার কারণে। কিউবার রাস্তাঘাটে চলা কানাঘুষায় স্প্যানিশ সরকারের টনক নড়ে ওঠায় ব্রাইসনকে পত্রপাঠ বিদায় হতে হয়েছিল, তবে তার তথ্য সংগ্রহের
          কাজ হার্স্টের মিশন চালিয়ে যাওয়ার জন্য যথেষ্ট। হার্স্ট এবার পাঠালেন ২৯ বছর বয়সী অ্যাডভেঞ্চারপ্রিয় সাংবাদিক কার্ল ডেকারকে, যিনি পাঠকদের কাছে
          পরিচিত চার্লস ডুভাল ছদ্মনামে।
        </p>
      </ContentContainerStyled>
    </Container>
  );
};

export default ContentContainer;
